# Voltage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..Voltage Property
AreaBasedLoadData Class See Also
---
The voltage of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double Voltage { get; set; }
```

Visual Basic
---
```text
Public Property Voltage As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Voltage {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for voltage is not a number -or- When setting this property: The given value for voltage is not finite |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for voltage must be positive. |

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace